<a href="https://colab.research.google.com/github/coredump064/test/blob/master/Pandas_%EB%9D%BC%EC%9D%B4%EB%B8%8C%EB%9F%AC%EB%A6%AC%EC%97%90_%EB%8C%80%ED%95%B4%EC%84%9C_%EC%95%8C%EC%95%84%EB%B3%B4%EC%9E%90.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# **Pandas 라이브러리**

주의 사항

1. 주석 처리된 것을 지우고 실행하는 것이 아니라 따라서 작성한 후, 실행하시기 바랍니다.

2. 실행방법 shift + enter

3. 모든 자료는 유튜브 Minsuk Heo 허민석님의 Pandas 팬더스 강의 기초 실습을 
바탕으로 제작됐습니다.

In [0]:
import pandas as pd

Pandas는 파이썬의 라이브러리이다.

팬더스는 데이터를 수정하고 목적에 맞게 변경하는 중요한 라이브러리

import pandas as pd

판다스를 import하고 pd로 쓰겠다.

In [0]:
"""
엑셀이 있는데 판다스를 쓰는이유
1. 엑셀은 프로그램을 만들수 없다. 
  파이썬으로 프로그램을 만들고 그안에서 데이터들을 관리하고 싶을 때 사용하는 것이 팬더스이다.
2. 팬더스는 numpy를 쓰기때문에 숫자를 다루는데 매우 강력하다.
3. 수학적으로 무언가를 변경하고 다루는데 엑셀보다 훨씬 빠르다.
"""

In [0]:
friend_list = [
    ['name', ['John', 'Jenny', 'Nate']],
    ['age', [20, 30, 40]],
    ['job', ['student', 'developer', 'teacher']],
]

In [0]:
data_frame = pd.DataFrame.from_items(friend_list)
data_frame

/usr/local/lib/python2.7/dist-packages/ipykernel_launcher.py:1: FutureWarning: from_items is deprecated. Please use DataFrame.from_dict(dict(items), ...) instead. DataFrame.from_dict(OrderedDict(items)) may be used to preserve the key order.
  """Entry point for launching an IPython kernel.

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   40    teacher

In [0]:
"""
data_frame의 출력
data_frame.head() 위에서 5개
data_frame.head(2) 위에서 2개
data_frame.tail(2) 밑에서 2개
"""
data_frame.tail(2)

    name  age        job
1  Jenny   30  developer
2   Nate   40    teacher

name, age, job들이 데이터프레임의 열(Colum)들이다.
column들을 series라고 하는데 거꾸로 말하면 series로 구성된게 데이터프레임이다.
데이터프레임은 series의 결합체이다. 각각의 column은 series이다.

In [0]:
type(data_frame.name)

pandas.core.series.Series

pandas.core.series.Series 가 출력된 것을 볼 수 있다. 당연히 column들이 series이기 때문의 column의 type이 series로 출력된 것이다. 다시 말하지만, 데이터프레임은 series들의 결합체이다.

# series만들기
series는 어떻게 만드는가?
파이썬의 list로 만들 수 있다.

In [0]:
list1 = [1, 2, 3]
list1

[1, 2, 3]

In [0]:
s1 = pd.core.series.Series([1, 2, 3])

In [0]:
s2 = pd.core.series.Series(['one', 'two', 'three'])

list로 만든 series s1, s2 두개로 데이터 프레임을 만들어보자.

In [0]:
pd.DataFrame(data=dict(num=s1, word=s2))

   num   word
0    1    one
1    2    two
2    3  three

파이썬 list를 이용해 series를 만들었고 series를 이용해서 데이터프레임을 만들었다.

이것들은 판다스 라이브러리를 pd로 import해서 그 안의 함수들로 만들었다.

# 파일에서 데이터 불러오기
파일을 불러오기 전에 코랩 디렉토리에 해당 파일을 업로드해야 한다.

In [0]:
from google.colab import files
uploaded = files.upload()
# friend_list.csv파일을 업로드

Saving friend_list.csv to friend_list (1).csv

In [0]:
df = pd.read_csv('./friend_list.csv')
#이런식으로 경로를 read_csv()함수를 이용해서 데이터프레임을 읽어올수있다.
# ./ : 현재 자신의 디렉토리
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

파일을 불러오는 것은 .csv파일 뿐만 아니라 다른 파일에서도 불러올 수 있다.

In [0]:
from google.colab import files
uploaded = files.upload()
# friend_list.txt파일을 업로드

Saving friend_list.txt to friend_list.txt

In [0]:
df = pd.read_csv('./friend_list.txt')
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

txt파일은 엑셀파일과 동일하다. 단지 ,로 데이터들이 구분되어 있을 뿐이다. 그러면 탭으로 구분되어 있을 때는 어떻게 불러와야 할까?

In [0]:
from google.colab import files
uploaded = files.upload()
# friend_list_tab.txt파일을 업로드

Saving friend_list_tab.txt to friend_list_tab.txt

In [0]:
df = pd.read_csv('./friend_list_tab.txt')
df
# 뭔가 데이터가 잘못된 것을 볼수있다.

         name\tage\tjob
0     John\t20\tstudent
1  Jenny\t30\tdeveloper
2     Nate\t30\tteacher
3    Julia\t40\tdentist
4    Brian\t45\tmanager
5     Chris\t25\tintern

3개의 시리즈가 생성되지 않고 name age job이라는 하나의 시리즈가 생성되고 탭이 데이터 안으로 들어가 버렸다. 이러한 문제를 방지하기 위해서 하나의 파라미터를 추가적으로 더해줘야한다.

In [0]:
df = pd.read_csv('./friend_list_tab.txt', delimiter = '\t')
df
# delimiter가 ,가 아닌 탭이라는 것을 알려주는 것.

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

항상 첫번째 행은 컬럼(시리즈)이름이 있었는데 그렇지 않을 때는 어떻게 해야할까?

In [0]:
from google.colab import files
uploaded = files.upload()
# friend_list_no_head.csv파일을 업로드

Saving friend_list_no_head.csv to friend_list_no_head (1).csv

In [0]:
df = pd.read_csv('./friend_list_no_head.csv')
df

    John  20    student
0  Jenny  30  developer
1   Nate  30    teacher
2  Julia  40    dentist
3  Brian  45    manager
4  Chris  25     intern

첫번째 데이터가 컬럼네임으로 들어가버린 것을 볼 수 있다. 이것을 방지하기 위해 head가 없다는 것을 명시해야한다.

In [0]:
df = pd.read_csv('./friend_list_no_head.csv', header = None)
df

       0   1          2
0   John  20    student
1  Jenny  30  developer
2   Nate  30    teacher
3  Julia  40    dentist
4  Brian  45    manager
5  Chris  25     intern

In [0]:
# 컬럼네임 명시하기
df.columns = ['name', 'age', 'job']
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [0]:
# 위의 파일을 읽어오고 컬럼네임을 명시하는 2단계를 1단계로 합쳐보자.
df = pd.read_csv('./friend_list_no_head.csv', header = None, names = ['name', 'age', 'job'])
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

# 데이터프레임 생성하기
리스트와 딕셔너리로 데이터프레임을 만들어보자.

# 딕셔너리 이용해서 만들기

In [0]:
 friend_dict_list = [
     {'name' : 'John', 'age' : 25, 'job' : 'student'}, 
     {'name' : 'Nate', 'age' : 30, 'job' : 'teacher'}, 
     
 ]

In [0]:
df = pd.DataFrame(friend_dict_list)
df.head()

   age      job  name
0   25  student  John
1   30  teacher  Nate

컬럼네임의 순서가 뒤바뀐 것을 볼 수 있다.

In [0]:
df = df[['name', 'age', 'job']]
df

   name  age      job
0  John   25  student
1  Nate   30  teacher

이렇게 방식이 번거롭다면 파이썬의 ordered dictionary를 사용하는 방법이 있다.

먼저 콜렉션에서 Ordered Dictionary를 가져온다.

Ordered dictionary는 키의 순서를 보장하기 때문에 컬럼네임을 다시 명시할 필요가 없다.

In [0]:
from collections import OrderedDict

In [0]:
friend_ordered_dict = OrderedDict([
    ('name', ['John', 'Nate']),
    ('age', [25, 30]),
    ('job', ['student', 'teacher'])
])

In [0]:
df = pd.DataFrame.from_dict(friend_ordered_dict)
df

   name  age      job
0  John   25  student
1  Nate   30  teacher

# 리스트 이용해서 만들기

In [0]:
friend_list = [
    {'John', 20, 'student'},
    {'Nate', 30, 'teacher'}
]

In [0]:
column_name = ['name', 'age', 'job']

In [0]:
df = pd.DataFrame.from_records(friend_list, columns = column_name)
df

   name   age      job
0  John    20  student
1    30  Nate  teacher

In [0]:
#한번에 만들어보자.
friend_list = [
    ['name', ['John', 'Nate']],
    ['age', [20, 30]],
    ['job', ['student', 'teacher']],
]

In [0]:
df = pd.DataFrame.from_items(friend_list)
df

/usr/local/lib/python2.7/dist-packages/ipykernel_launcher.py:1: FutureWarning: from_items is deprecated. Please use DataFrame.from_dict(dict(items), ...) instead. DataFrame.from_dict(OrderedDict(items)) may be used to preserve the key order.
  """Entry point for launching an IPython kernel.

   name  age      job
0  John   20  student
1  Nate   30  teacher

![대체 텍스트](https://postfiles.pstatic.net/MjAxODEyMTBfMjcw/MDAxNTQ0NDM3NDY3Mzk3.sJuST_9LAZmJyR2XYvEgNaHhQ8KUck5nrKYJ91c-RAQg.wqlmPmspr_YNzHNUNDGtNFT5gZ-bGa8hMMVMiCCCIJ8g.PNG.cjh226/pandas-dataframe-shadow.png?type=w580)


다음 그림은 4가지 경우에 대해서 직관적으로 이해할 수 있게 정리된 그림이다.

# 데이터프레임을 파일로 저장하기(to_csv)

In [0]:
friend_list = [
    ['name', ['John', 'Nate', 'Dowon', 'Thanos']],
    ['age', [20, 30, 23, 44]],
    ['job', ['student', 'teacher', 'backsoo', 'None']],
    
]
df = pd.DataFrame.from_items(friend_list)
df

/usr/local/lib/python2.7/dist-packages/ipykernel_launcher.py:7: FutureWarning: from_items is deprecated. Please use DataFrame.from_dict(dict(items), ...) instead. DataFrame.from_dict(OrderedDict(items)) may be used to preserve the key order.
  import sys

     name  age      job
0    John   20  student
1    Nate   30  teacher
2   Dowon   23  backsoo
3  Thanos   44     None

In [0]:
# 위에 데이터프레임을 .csv파일로 저장해보자.
df.to_csv('friends.csv')

In [0]:
ls

'friend_list (1).csv'           friend_list_no_head.csv   friends.csv
 friend_list.csv                friend_list_tab.txt       friends_no_index.csv
'friend_list_no_head (1).csv'   friend_list.txt           sample_data/

friends.csv파일이 생성된 것을 볼 수 있다.

사실 to_csv에는 index=True, header=True가 default값으로 생략된 것이다.

index=False로 설정하면 로우네임이 없이 저장되고, header=False는 컬럼네임이 없이 저장된다.

# 행과 열 선택 및 필터하기

# 1. 컬럼 선택하기

In [0]:
from google.colab import files
uploaded = files.upload()
# avengers.csv

Saving avengers.csv to avengers (2).csv

In [0]:
df = pd.read_csv('./avengers (1).csv')
df

      name  age       job
0  ironman   35  engineer
1   thanos   44    farmer
2  captain   19      nerd
3     hulk   25   patient
4     roki    7    infant
5    groot  203      tree

In [0]:
# 세명 중 두명의 정보만 원한다고 가정하고 John과 Nate의 정보만 출력해보자.
df[0:2]

      name  age       job
0  ironman   35  engineer
1   thanos   44    farmer

파이썬은 대게 첫번째 인덱스는 포함하고 두번째 인덱스는 포함하지 않는다.

df가 수정되었다고 착각하면 안된다. df는 그대로 남아있다. 만일 해당 결과를 저장하고 싶을 때는 이렇게 하면 된다.

In [0]:
df

      name  age       job
0  ironman   35  engineer
1   thanos   44    farmer
2  captain   19      nerd
3     hulk   25   patient
4     roki    7    infant
5    groot  203      tree

In [0]:
df = df[0:2]
df

      name  age       job
0  ironman   35  engineer
1   thanos   44    farmer

In [0]:
df = pd.read_csv('./avengers (1).csv')
df

      name  age       job
0  ironman   35  engineer
1   thanos   44    farmer
2  captain   19      nerd
3     hulk   25   patient
4     roki    7    infant
5    groot  203      tree

불연속적인 데이터를 불러오기

John과 Jenny의 데이터는 연속적이지 않고 떨어져있다. 이런 불연속적인 데이터를 불러올 때는 loc[]함수를 사용한다.

In [0]:
df.loc[[0,2]]

      name  age       job
0  ironman   35  engineer
2  captain   19      nerd

In [0]:
# 당연히 기존의 df는 변경되지 않는다.
df

      name  age       job
0  ironman   35  engineer
1   thanos   44    farmer
2  captain   19      nerd
3     hulk   25   patient
4     roki    7    infant
5    groot  203      tree

In [0]:
# 적용시키기 위해서는 아까처럼 df에 대입하면 된다.
df = df.loc[[0,2]]
df

      name  age       job
0  ironman   35  engineer
2  captain   19      nerd

# 2. row 선택하기
by column condition

In [0]:
df = pd.read_csv('./avengers (1).csv')
df

      name  age       job
0  ironman   35  engineer
1   thanos   44    farmer
2  captain   19      nerd
3     hulk   25   patient
4     roki    7    infant
5    groot  203      tree

In [0]:
# df의 컬럼요소를 이용해서 row필터하기
df[df.age > 25]

      name  age       job
0  ironman   35  engineer
1   thanos   44    farmer
5    groot  203      tree

In [0]:
df.query('age>25')

      name  age       job
0  ironman   35  engineer
1   thanos   44    farmer
5    groot  203      tree

In [0]:
# 나이가 30살 이상이고 직업이 농부인 사람을 선택해보자.
df[(df.age > 30) & (df.job == 'farmer')]

     name  age     job
1  thanos   44  farmer

# 컬럼 필터하기

1. 인덱스 이용해서 필터하기

In [0]:
friend_list = [
    ['John', 20, 'student'],
    ['Jenny', 30, 'developer'],
    ['Nate', 30, 'teacher'],
]
df = pd.DataFrame.from_records(friend_list)
df

       0   1          2
0   John  20    student
1  Jenny  30  developer
2   Nate  30    teacher

In [0]:
# 컬럼인덱스 0부터 1까지만 필요한 경우
df.iloc[:,0:2]

       0   1
0   John  20
1  Jenny  30
2   Nate  30

콤마(,)를 기준으로 앞부분과 뒷부분이 나뉜다. 앞부분은 row에 대한 것으로 :만 한것은 모두 선택한다는 뜻이다. 그리고 뒤에 0:2는 컬럼 0번 부터 1번까지 선택한 것이다

In [0]:
# df.iloc[0:2,0:2] 를 하면 어떻게 될까?

       0   1
0   John  20
1  Jenny  30

# 컬럼네임으로 필터하기

In [0]:
df = pd.read_csv('./avengers (1).csv')
df

      name  age       job
0  ironman   35  engineer
1   thanos   44    farmer
2  captain   19      nerd
3     hulk   25   patient
4     roki    7    infant
5    groot  203      tree

In [0]:
df_filtered = df[['name', 'age']]
df_filtered

      name  age
0  ironman   35
1   thanos   44
2  captain   19
3     hulk   25
4     roki    7
5    groot  203

성공적으로 데이터프레임에서 데이터를 "filter out" 했다.

In [0]:
# 다른 방법으로 해보자.
df.filter(items=['age', 'job'])

   age       job
0   35  engineer
1   44    farmer
2   19      nerd
3   25   patient
4    7    infant
5  203      tree

filter()함수를 쓰면 효율적으로 필터링이 가능하다.

In [0]:
# 컬럼네임에서 a가 들어가는 것만 필터해보자.
df.filter(like='a', axis=1)

      name  age
0  ironman   35
1   thanos   44
2  captain   19
3     hulk   25
4     roki    7
5    groot  203

axis=1은 컬럼을 선택한 것이다. 컬럼의 axis는 1이다.

In [0]:
df.filter(regex='b$', axis=1)

        job
0  engineer
1    farmer
2      nerd
3   patient
4    infant
5      tree

regex(정규식)을 이용해서 필터했다.

# row와 column삭제하기

In [0]:
df = pd.read_csv('./avengers (1).csv')
df

      name  age       job
0  ironman   35  engineer
1   thanos   44    farmer
2  captain   19      nerd
3     hulk   25   patient
4     roki    7    infant
5    groot  203      tree

타노스와 로키의 데이터를 없애보자.

# drop()

In [0]:
# drop함수를 이용해서 없애고 싶은 데이터의 인덱스를 적는다.
df.drop([1, 4])

      name  age       job
0  ironman   35  engineer
2  captain   19      nerd
3     hulk   25   patient
5    groot  203      tree

In [0]:
df

      name  age       job
0  ironman   35  engineer
1   thanos   44    farmer
2  captain   19      nerd
3     hulk   25   patient
4     roki    7    infant
5    groot  203      tree

물론 기존의 데이터프레임에 적용된 것은 아니다.

저번처럼 df = 을 이용하거나 inplace 옵션을 사용한다.

In [0]:
df.drop([1,4], inplace=True)

In [0]:
df

      name  age       job
0  ironman   35  engineer
2  captain   19      nerd
3     hulk   25   patient
5    groot  203      tree

# 컬럼조건으로 삭제하기

In [0]:
df = pd.read_csv('./avengers (1).csv')
df

      name  age       job
0  ironman   35  engineer
1   thanos   44    farmer
2  captain   19      nerd
3     hulk   25   patient
4     roki    7    infant
5    groot  203      tree

In [0]:
df = df[df.age > 20]
df

      name  age       job
0  ironman   35  engineer
1   thanos   44    farmer
3     hulk   25   patient
5    groot  203      tree

# 컬럼 없애기

In [0]:
df = df.drop('age', axis=1) 
# axis=1로 설정하여 컬럼에 적용하도록 한다.

In [0]:
df

      name       job
0  ironman  engineer
1   thanos    farmer
3     hulk   patient
5    groot      tree

# 행과 열 수정하기

In [0]:
df = pd.read_csv('avengers (1).csv')
df

      name  age       job
0  ironman   35  engineer
1   thanos   44    farmer
2  captain   19      nerd
3     hulk   25   patient
4     roki    7    infant
5    groot  203      tree

연봉 컬럼을 추가해보자.

In [0]:
df['salary'] = 0
df

      name  age       job  salary
0  ironman   35  engineer       0
1   thanos   44    farmer       0
2  captain   19      nerd       0
3     hulk   25   patient       0
4     roki    7    infant       0
5    groot  203      tree       0

쉽다.

현재 모든 연봉이 0으로 설정되었는데 나무는 연봉이 없다. 이것을 표현하려면 어떻게 해야할까?

In [0]:
# numpy라이브러리를 포함한다.
import numpy as np

In [0]:
df['salary'] = np.where(df['job'] == 'tree', 'no', 'yes')

In [0]:
df

      name  age       job salary
0  ironman   35  engineer    yes
1   thanos   44    farmer    yes
2  captain   19      nerd    yes
3     hulk   25   patient    yes
4     roki    7    infant    yes
5    groot  203      tree     no

# 컬럼 값 더하기

In [0]:
from google.colab import files
uploaded = files.upload()
# scores.csv

Saving scores.csv to scores.csv

In [0]:
df = pd.read_csv('./scores.csv')
df

    name  midterm  final
0    오도원      100    100
1    오도투       60     70
2   오도쓰리       64     96
3    오도포       32     55
4  오도파이브        0     88

In [0]:
# 총점 컬럼을 추가하자
df['total'] = df['midterm'] + df['final']

In [0]:
df

    name  midterm  final  total
0    오도원      100    100    200
1    오도투       60     70    130
2   오도쓰리       64     96    160
3    오도포       32     55     87
4  오도파이브        0     88     88

In [0]:
# 평균 컬럼 추가하기
df['average'] = df['total'] / 2
df

    name  midterm  final  total  average
0    오도원      100    100    200    100.0
1    오도투       60     70    130     65.0
2   오도쓰리       64     96    160     80.0
3    오도포       32     55     87     43.5
4  오도파이브        0     88     88     44.0

리스트를 사용해서 성적을 추가해보자.

In [0]:
grades = []
for row in df['average']:
  if row >= 90:
    grades.append('A')
  elif row >= 70:
    grades.append('B')
  else:
    grades.append('F')

In [0]:
df['grades'] = grades

In [0]:
df

    name  midterm  final  total  average grades
0    오도원      100    100    200    100.0      A
1    오도투       60     70    130     65.0      F
2   오도쓰리       64     96    160     80.0      B
3    오도포       32     55     87     43.5      F
4  오도파이브        0     88     88     44.0      F

이번에는 grdaes에서 F받은 학생들을 fail, 아닌 학생들은 pass를 변경해보자. apply()함수를 사용한다.

In [0]:
def pass_or_fail(row):
  if row != 'F':
    return "Pass"
  else:
    return "Fail"

In [0]:
df.grades = df.grades.apply(pass_or_fail)

In [0]:
df

    name  midterm  final  total  average grades
0    오도원      100    100    200    100.0   Pass
1    오도투       60     70    130     65.0   Fail
2   오도쓰리       64     96    160     80.0   Pass
3    오도포       32     55     87     43.5   Fail
4  오도파이브        0     88     88     44.0   Fail

즉, grades.apply(pass_or_fail)는 각 row마다 함수의 인자로 넣어준 후 그 리턴값을 다시 grades로 넣어준 것이다.

# featrue engineering에서 feature extraction

In [0]:
from google.colab import files
uploaded = files.upload()
# date.csv

Saving date.csv to date.csv

In [0]:
df = pd.read_csv('./date.csv')

In [0]:
df

   yyyy-mm-dd
0  1997-06-22
1  2000-09-15
2  2007-10-08

이 데이터에서 년도만 빼내오자

In [0]:
def extract_year(row):
  return row.split('-')[0]

split()함수를 이용해서 -로 구분하고 년도는 첫번째 인자이므로 0번째 인덱스를 넣는다.

In [0]:
df['year'] = df['yyyy-mm-dd'].apply(extract_year)

In [0]:
df

   yyyy-mm-dd  year
0  1997-06-22  1997
1  2000-09-15  2000
2  2007-10-08  2007

즉, 분류할 조건을 함수로 만들어서 apply()함수의 인자로 넘겨주는 것이다.

# 행 생성하기

In [0]:
df = pd.read_csv('./scores.csv')

In [0]:
df

    name  midterm  final
0    오도원      100    100
1    오도투       60     70
2   오도쓰리       64     96
3    오도포       32     55
4  오도파이브        0     88

여기에 새로운 사람을 추가해보자.

In [0]:
df2 = pd.DataFrame([
    ['육도원', 50, 50]
], columns = ['name', 'midterm', 'final'])

In [0]:
df2

  name  midterm  final
0  육도원       50     50

이 만들어진 데이터프레임을 기존의 데이터프레임을 합친다.

In [0]:
df.append(df2, ignore_index=True)
# index를 무시하는 이유는 육도원의 인덱스가 0이므로 기존의 데이터 프레임과 겹치기 때문이다.

    name  midterm  final
0    오도원      100    100
1    오도투       60     70
2   오도쓰리       64     96
3    오도포       32     55
4  오도파이브        0     88
5    육도원       50     50

# 데이터 그룹 만들기 (group by)

In [0]:
from google.colab import files
uploaded = files.upload()
# major.csv

Saving major.csv to major.csv

In [0]:
df = pd.read_csv('./major.csv')

In [0]:
df

        name             major     sex
0       John  Computer Science    male
1       Nate  Computer Science    male
2    Abraham           Physics    male
3      Brian        Psychology    male
4      Jenny         Economics  female
5       Yuna         Economics  female
6   Jeniffer  Computer Science  female
7     Edward  Computer Science    male
8       Zara        Psychology  female
9      Wendy        Premedical  female
10      Sera           Physics  female

학과별로 몇명있는지 알아보자.

In [0]:
groupby_major = df.groupby('major')

In [0]:
groupby_major.groups

{'Computer Science': Int64Index([0, 1, 6, 7], dtype='int64'),
 'Economics': Int64Index([4, 5], dtype='int64'),
 'Physics': Int64Index([2, 10], dtype='int64'),
 'Premedical': Int64Index([9], dtype='int64'),
 'Psychology': Int64Index([3, 8], dtype='int64')}

보기 불편하다

In [0]:
for name, group in groupby_major:
  print(name + " : " + str(len(group)))
  print(group)
  print

Computer Science : 4
       name             major     sex
0      John  Computer Science    male
1      Nate  Computer Science    male
6  Jeniffer  Computer Science  female
7    Edward  Computer Science    male

Economics : 2
    name      major     sex
4  Jenny  Economics  female
5   Yuna  Economics  female

Physics : 2
       name    major     sex
2   Abraham  Physics    male
10     Sera  Physics  female

Premedical : 1
    name       major     sex
9  Wendy  Premedical  female

Psychology : 2
    name       major     sex
3  Brian  Psychology    male
8   Zara  Psychology  female

보기좋다

이 정보를 데이터프레임으로 만들어보자.

In [0]:
df_major_count = pd.DataFrame({'count' : groupby_major.size()})
df_major_count

                  count
major
Computer Science      4
Economics             2
Physics               2
Premedical            1
Psychology            2

major부분이 컬럼으로 들어가면 좋겠다. 
reset_index() 함수를 이용한다.

In [0]:
df_major_count = pd.DataFrame({'count' : groupby_major.size()}).reset_index()
df_major_count

              major  count
0  Computer Science      4
1         Economics      2
2           Physics      2
3        Premedical      1
4        Psychology      2

위에 작성한 for문을 활용해서 성별로 구분하는 것을 해보자.

# 중복 데이터 삭제하기 (drop duplicates)

In [0]:
from google.colab import files
uploaded = files.upload()
# duplicate.csv

Saving duplicate.csv to duplicate.csv

In [0]:
df = pd.read_csv('./duplicate.csv')

In [0]:
df.duplicated()

0     False
1     False
2     False
3     False
4     False
5     False
6      True
7      True
8     False
9     False
10    False
dtype: bool

현재 6, 7번 인덱스가 true인 것을 볼 수 있다. 이것은 중복됐다는 뜻이다.

In [0]:
df.drop_duplicates()

       name             major     sex
0      John  Computer Science    male
1      Nate  Computer Science    male
2   Abraham           Physics    male
3     Brian        Psychology    male
4     Jenny         Economics  female
5      Yuna         Economics  female
8      Zara        Psychology  female
9     Wendy        Premedical  female
10     Sera           Physics  female

중복된 데이터가 없어졌다.

그러나 데이터 분석을 할 때, row에 모든 데이터가 같을 때 보다는 name이 같을 때 지워라 같은 케이스가 더 많다. 즉, 열의 값을 이용해서 중복된 값을 알아내고 해당 중복된 값을 없애는 것이다.

In [0]:
from google.colab import files
uploaded = files.upload()
# duplicate2.csv

Saving duplicate2.csv to duplicate2.csv

In [0]:
df = pd.read_csv('./duplicate2.csv')
df

      name             major     sex
0     John  Computer Science    male
1     Nate  Computer Science    male
2  Abraham           Physics    male
3    Brian        Psychology    male
4    Jenny         Economics  female
5     Yuna         Economics  female
6     John              None    male
7     Zara        Psychology  female
8    Wendy        Premedical  female
9     Sera           Physics  female

In [0]:
df.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6    False
7    False
8    False
9    False
dtype: bool

완전히 같은 행이 없으므로 true값이 나타나지 않는다. 그러나 이름이 같은 행이 존재한다. 이럴 때, 파라미터를 하나 추가해준다.

In [0]:
df.duplicated(['name'])

0    False
1    False
2    False
3    False
4    False
5    False
6     True
7    False
8    False
9    False
dtype: bool

6번이 true이다. 이름이 같은 값이 발견되었다는 것이다.

In [0]:
df.drop_duplicates(['name'], keep = 'first')

      name             major     sex
0     John  Computer Science    male
1     Nate  Computer Science    male
2  Abraham           Physics    male
3    Brian        Psychology    male
4    Jenny         Economics  female
5     Yuna         Economics  female
7     Zara        Psychology  female
8    Wendy        Premedical  female
9     Sera           Physics  female

만일 뒤에 것을 살리고 싶다면 keep = 'last'으로 바꿔주면 된다. keep값을 안주면 default값으로 앞에 것이 산다.

# NaN(None)을 찾고 원하는 값으로 변경하기 (fillna)

실제로 데이터들을 다룰 때는 완전히 채워진 데이터보다 비어있는 값이 존재하는 경우를 볼때가 훨씬 많다.

In [0]:
from google.colab import files
uploaded = files.upload()
# nan_value.csv

Saving nan_value.csv to nan_value.csv

In [0]:
df = pd.read_csv('./nan_value.csv')
df

       name      job   age
0   ironman  teacher  50.0
1    thanos  student  19.0
2   captain  teacher  30.0
3      hulk  student  17.0
4      roki  teacher   NaN
5     groot  student   NaN
6     dowon  student  18.0
7  dodollar  teacher  44.0
8     douro  student  18.0

In [0]:
df.shape

(9, 3)

6개의 row와 3개의 column

In [0]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9 entries, 0 to 8
Data columns (total 3 columns):
name    9 non-null object
job     9 non-null object
age     7 non-null float64
dtypes: float64(1), object(2)
memory usage: 288.0+ bytes

name과 job은 6개 non-null, NaN값이 아닌데 age는 4개만 NaN값이 아니다. 즉, NaN값이 존재한다는 것이다.

다르게 확인하는 방법도 있다.

In [0]:
df.isna()

    name    job    age
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False
4  False  False   True
5  False  False   True
6  False  False  False
7  False  False  False
8  False  False  False

In [0]:
df.isnull()

    name    job    age
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False
4  False  False   True
5  False  False   True
6  False  False  False
7  False  False  False
8  False  False  False

이제 NaN값을 확인했으니 원하는 값으로 변경해보자. 먼저 0으로 바꿔보자

In [0]:
df.age = df.age.fillna(0)
# df.age에서 nan값을 발견하면 0으로 채워라

In [0]:
 df

       name      job   age
0   ironman  teacher  50.0
1    thanos  student  19.0
2   captain  teacher  30.0
3      hulk  student  17.0
4      roki  teacher   0.0
5     groot  student   0.0
6     dowon  student  18.0
7  dodollar  teacher  44.0
8     douro  student  18.0

0으로 바꿔보았다. 그러나 데이터 분석을 할때는 이러한 nan값을 보면 그럴싸한 값으로 변경해주어야 한다. 나중에 모델을 학습시킬 때 이렇게 비어있는 값들은 그대로 비워두거나 0으로 하는 것보다는 중간값 혹은 평균값으로 채워넣는 것이 좋다.

여기서는 중간값으로 채워보자.

In [0]:
df = pd.read_csv('nan_value.csv')
df

       name      job   age
0   ironman  teacher  50.0
1    thanos  student  19.0
2   captain  teacher  30.0
3      hulk  student  17.0
4      roki  teacher   NaN
5     groot  student   NaN
6     dowon  student  18.0
7  dodollar  teacher  44.0
8     douro  student  18.0

In [0]:
df['age'].fillna(df.groupby('job')['age'].transform('median'), inplace = True)

df의 age컬럼에서 nan값을 채운다. 무엇으로 채우냐. job으로 구분하고 age값의 nan값을 median값으로 채운다.

In [0]:
df

       name      job   age
0   ironman  teacher  50.0
1    thanos  student  19.0
2   captain  teacher  30.0
3      hulk  student  17.0
4      roki  teacher  44.0
5     groot  student  18.0
6     dowon  student  18.0
7  dodollar  teacher  44.0
8     douro  student  18.0

nan값이었던 4번과 5번이 teacher와 student의 중간값으로 채워졌다.

# apply()함수에 대해서 알아보자

In [0]:
df = pd.read_csv('date.csv')
df

   yyyy-mm-dd
0  1997-06-22
1  2000-09-15
2  2007-10-08

컬럼이 yyyy-mm-dd로 하나밖에 없는데, apply함수를 사용해서 year컬럼을 추가한다. year컬럼의 값은 yyyy에 해당하는 값이다.

In [0]:
def extract_year(column):
  return column.split("-")[0]

하나의 컬럼을 받았을 때, 이 전체값에서 -로 분류해서 0번째 값을 리턴하라는 뜻이다.

In [0]:
df['year'] = df['yyyy-mm-dd'].apply(extract_year)

In [0]:
df

   yyyy-mm-dd  year
0  1997-06-22  1997
1  2000-09-15  2000
2  2007-10-08  2007

apply함수에 가장 기초적인 형태이다. 그런데 여기 의문이 생길 수 있다. apply에 함수이름만 넘겨줬는데 파라미터는 어떻게 넘겨준 것인가? 그래서 이번에는 인자를 넘겨줘보자.

In [0]:
def get_age(year, current_year):
  return current_year - int(year)

In [0]:
df['age'] = df['year'].apply(get_age, current_year=2019)

In [0]:
df

   yyyy-mm-dd  year  age
0  1997-06-22  1997   22
1  2000-09-15  2000   19
2  2007-10-08  2007   12

이번에는 파라미터를 여러개 넘겨줘보자.

In [0]:
def get_introduce(age, prefix, suffix):
  return prefix + str(age) + suffix

In [0]:
df['introduce'] = df['age'].apply(get_introduce, prefix='I am ', suffix=' years old.')

In [0]:
df

   yyyy-mm-dd  year  age           introduce
0  1997-06-22  1997   22  I am 22 years old.
1  2000-09-15  2000   19  I am 19 years old.
2  2007-10-08  2007   12  I am 12 years old.

이번에는 여러개의 컬럼에 apply함수를 적용해보자.

In [0]:
def get_introduce_2(row):
  return 'I was born in ' + str(row.year) + ' my age is ' + str(row.age)

# row.year, row.age 이렇게 컬럼두개가 들어간 것을 볼수있다.

In [0]:
df.introduce = df.apply(get_introduce_2, axis = 1)

df.introduce는 df['introduce']라고 쓴것과 동일하다.

단, 새로 만들고 싶은 컬럼은 df.newcolumn을 못쓴다. 그러때는 df['newcolumn']형태로 해야한다.

In [0]:
df

   yyyy-mm-dd  year  age                        introduce
0  1997-06-22  1997   22  I was born in 1997 my age is 22
1  2000-09-15  2000   19  I was born in 2000 my age is 19
2  2007-10-08  2007   12  I was born in 2007 my age is 12

# map과 applymap함수에 대해서 알아보자.

In [0]:
from google.colab import files
uploaded = files.upload()
# date2.csv

Saving date2.csv to date2.csv

In [0]:
df = pd.read_csv('./date2.csv')
df

         date
0  1997-06-22
1  2000-12-25
2  2019-10-04

In [0]:
def extract_year(date):
  return date.split('-')[0]

In [0]:
df['year'] = df.date.map(extract_year)
# df['date'].map과 동일하다.

In [0]:
df

         date  year
0  1997-06-22  1997
1  2000-12-25  2000
2  2019-10-04  2019

머신러닝을 할 때는 텍스트 값들을 숫자로 바꿔야할 때가 존재한다. 그럴 때 이 map함수를 쓰면 아주 편리하게 바꿀 수 있다.

In [0]:
job_list = [
    {'age' : 20, 'job' : 'student'},
    {'age' : 30, 'job' : 'teacher'},
    {'age' : 30, 'job' : 'developer'},
]
df = pd.DataFrame(job_list)
df

   age        job
0   20    student
1   30    teacher
2   30  developer

In [0]:
df.job = df.job.map({'student':1, 'developer':2, 'teacher':3})

In [0]:
df

   age  job
0   20    1
1   30    3
2   30    2

딕셔너리를 넘겨줘서 해당 컬럼값을 변경해주었다.

In [0]:
from google.colab import files
uploaded = files.upload()
# xyz.csv

Saving xyz.csv to xyz.csv

In [0]:
df = pd.read_csv('./xyz.csv')
df

     x    y    z
0  5.5 -5.6 -1.1
1 -5.2  5.5 -2.2
2 -1.6 -4.5 -3.3

단 하나의 컬럼이 아닌 모든 컬럼에 적용하고 싶을때는 applymap함수를 사용하는 것이다.

In [0]:
# numpy를 사용
df = df.applymap(np.around)
df

     x    y    z
0  6.0 -6.0 -1.0
1 -5.0  6.0 -2.0
2 -2.0 -4.0 -3.0

이처럼 모든 컬럼에 적용할 때는 applymap을 사용하고 하나의 컬럼에 대해서 컬럼값을 변경하고 싶을 때는 map을 사용하면 된다.

# 유니크한 값 뽑아내기 unique, value_counts

# 컬럼 내 유니크한 값 뽑아내고 개수 확인하기

In [0]:
df = pd.read_csv('./major.csv')
df

        name             major     sex
0       John  Computer Science    male
1       Nate  Computer Science    male
2    Abraham           Physics    male
3      Brian        Psychology    male
4      Jenny         Economics  female
5       Yuna         Economics  female
6   Jeniffer  Computer Science  female
7     Edward  Computer Science    male
8       Zara        Psychology  female
9      Wendy        Premedical  female
10      Sera           Physics  female

여기서 유니크하게 출력해보자.

In [0]:
df.major.unique()

array(['Computer Science', 'Physics', 'Psychology', 'Economics',
       'Premedical'], dtype=object)

주의할 것은 유니크한 값을 뽑아낸 것이 아니라 각 컬럼값들을 한번씩만 출력해준 것이다.

이번에는 각 전공별로 몇명이 있는지 알아보자.

In [0]:
df.major.value_counts()

Computer Science    4
Psychology          2
Physics             2
Economics           2
Premedical          1
Name: major, dtype: int64

# 두개의 데이터 프레임 합치기(concat, append)

In [0]:
from google.colab import files
uploaded = files.upload()
# df1.csv, df2.csv, df3.csv

Saving df3.csv to df3.csv

In [0]:
df1 = pd.read_csv('./df1.csv')
df2 = pd.read_csv('./df2.csv')
df1

   name        job
0  John    teacher
1  Nate    student
2  Fred  developer

In [0]:
df2

   name       job
0    Ed   dentist
1  Jack    farmer
2   Ted  designer

컬럼네임이 같으므로 row로 합쳐보자. 두 가지 방식이 있다.

# 1. pd.concat()
concatenation

In [0]:
result = pd.concat([df1, df2])

In [0]:
result

   name        job
0  John    teacher
1  Nate    student
2  Fred  developer
0    Ed    dentist
1  Jack     farmer
2   Ted   designer

합쳐지긴 했는데 인덱스가 똑같다

In [0]:
result = pd.concat([df1, df2], ignore_index=True)

In [0]:
result

   name        job
0  John    teacher
1  Nate    student
2  Fred  developer
3    Ed    dentist
4  Jack     farmer
5   Ted   designer

ignore_index=True로 설정하면 된다.

# 2. df.append()

In [0]:
result = df1.append(df2, ignore_index = True)

In [0]:
result

   name        job
0  John    teacher
1  Nate    student
2  Fred  developer
3    Ed    dentist
4  Jack     farmer
5   Ted   designer

# 컬럼으로 합치기

In [0]:
df3 = pd.read_csv('./df3.csv')

In [0]:
df1

   name        job
0  John    teacher
1  Nate    student
2  Fred  developer

In [0]:
df3

   age country
0   25     U.S
1   30     U.K
2   45   Korea

In [0]:
result = pd.concat([df1, df3], axis=1, ignore_index=True)

열에 적용하는 것이므로 axis=1로 설정

In [0]:
result

      0          1   2      3
0  John    teacher  25    U.S
1  Nate    student  30    U.K
2  Fred  developer  45  Korea

두개의 데이터프레임이 열로 합쳐진 것을 볼 수 있다.

# 추가. 리스트 합치기

데이터 사이언스를 하다보면 머신러닝을 진행할 때 실제값과 예측값을 비교해야 하는 경우가 많다.

In [0]:
label = [1, 2, 3 ,4 , 5]
prediction = [1, 2, 2, 4, 4]

리스트 형식으로 있을 때는 값들을 비교하며 분간하기가 어렵다. 이럴때는 데이터프레임으로 만들어서 비교하는 것이 편하다.

In [0]:
comparison = pd.DataFrame({'label': label, 'prediction' : prediction})

In [0]:
comparison

   label  prediction
0      1           1
1      2           2
2      3           2
3      4           4
4      5           4

# 고생하셨습니다!